spec/fixtures/vcr_cassettes/Billing_address_update/user_is_not_billable/with_an_incomplete_billing_address_and_no_credit_card/Updates_his_billing_address_and_credit_card_successfully.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=UT62Y7X3&CARDNO=4111111111111111&CN=Jilion+Team&CVC=111&ECI=7&ED=0614&EMAIL=email1%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=42666&Owneraddress=42+Abey+Road&PARAMPLUS=CHECK_CC_USER_ID%3D593&PSPID=jilion&PSWD=WWQMNC89&SHASign=E06DF0217D5D4855D69688E429CEB3A0ACA7A2F7FE13E27BF23C5E751119000675A999E019C2BC288F461E7C94F05E4F0B375CE2F8803AECD74F15930048FBFE&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=d4e1fc9548402d55d7f1afd87873a5&ownercty=us&ownertown=New+York
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 02 Oct 2013 07:53:25 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Wed, 02 Oct 2013 07:52:23 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_485090132_0=1887424482_2213316;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"d4e1fc9548402d55d7f1afd87873a5\"\r\nPAYID=\"24048557\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"UT62Y7X3\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Wed, 02 Oct 2013 07:53:25 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=24048557&PSPID=jilion&PSWD=WWQMNC89&SHASign=4D9E32F698576D43D2585A9AF98048FF31AC42A597416088F4D82C6466471F04F522289FD879C3D16DC6593793EC00F0FDC94AA9F48CA816FAE8AC4B916301EB&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 02 Oct 2013 07:53:25 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Wed, 02 Oct 2013 07:52:25 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_485090132_0=1887424500_2213316;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"d4e1fc9548402d55d7f1afd87873a5\"\r\nPAYID=\"24048557\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Wed, 02 Oct 2013 07:53:26 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=24048557&PSPID=jilion&PSWD=WWQMNC89&SHASign=4D9E32F698576D43D2585A9AF98048FF31AC42A597416088F4D82C6466471F04F522289FD879C3D16DC6593793EC00F0FDC94AA9F48CA816FAE8AC4B916301EB&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 02 Oct 2013 07:53:26 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Wed, 02 Oct 2013 07:52:26 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_485090132_0=1887424516_2213317;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"d4e1fc9548402d55d7f1afd87873a5\"\r\nPAYID=\"24048557\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Wed, 02 Oct 2013 07:53:26 GMT
recorded_with: VCR 2.6.0
